{"class_name": "Model", "keras_version": "1.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 40, 300], "name": "input_2", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_3", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.1, "dropout_W": 0.1, "input_dim": 300, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 100, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "lstm_3"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_4", "inner_activation": "hard_sigmoid", "go_backwards": true, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.1, "dropout_W": 0.1, "input_dim": 300, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 100, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "lstm_4"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["lstm_3", 0, 0], ["lstm_4", 0, 0]]], "name": "merge_2"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 4}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_2"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_2"}}